Tekla.Structures.ModelInternal.dotControlObject_t
Struct for the ControlPlane.

Tekla.Structures.ModelInternal.dotControlObject_t.ModelObject
The object we are extending (Inherited from)

Tekla.Structures.ModelInternal.dotControlObject_t.Plane
The Plane

Tekla.Structures.ModelInternal.dotControlObject_t.Color
The Color

Tekla.Structures.ModelInternal.dotControlObject_t.IsMagnetic
Determines if the Plane is Magnetic or not

Tekla.Structures.ModelInternal.dotControlObject_t.Extension
The line extension

Tekla.Structures.ModelInternal.dotControlObject_t.aName
The Name of the ControlPlane

Tekla.Structures.ModelInternal.dotControlObject_t.LineType
The line type